alfavit={"а":1, "б":2, "в":3, "г":4, "д":5, "е":6, "ё":7, "ж":8, "з":9, "и":10, "й":11, "к":12, "л":13, "м":14, "н":15, "о":16, "п":17, "р":18, "с":19, "т":20, "у":21, "ф":22, "х":23, "ц":24, "ч":25, "ш":26, "щ":27, "ъ":28, "ы":29, "ь":30,"э":31, "ю":32, "я":33}

alfavit2={1:"а", 2:"б", 3:"в", 4:"г", 5:"д", 6:"е", 7:"ё", 8:"ж", 9:"з", 10:"и", 11:"й", 12:"к", 13:"л", 14:"м", 15:"н", 16:"о", 17:"п", 18:"р", 19:"с", 20:"т", 21:"у", 22:"ф", 23:"х",24:"ц", 25:"ч", 26:"ш", 27:"щ", 28:"ъ", 29:"ы", 30:"ь", 31:"э", 32:"ю", 33:"я"}
number=[]
print("введите слово")
word=input()

for i in word:
    if i in alfavit.keys():
        number.append(alfavit[i])
z=-1
k=-1
n=0
while(z!=-len(number)-1):
    j=number[z]-number[k]
    k=k-1
    if(k==-len(number)-1):
      z=z-1
      k=z
      if(j>0 and n==0):
        number[z], number[k+1]=number[k+1], number[z]
        n=n+1
        
        for i in number:
          if i in alfavit2.keys():
            print(alfavit2[i], end='')